<policy>
	<general>
		<name>Install Latest %DISPLAY_NAME%</name>
		<enabled>true</enabled>
		<frequency>Ongoing</frequency>
		<trigger_other>%POLICY_TRIGGER%</trigger_other>
		<category>
			<name>%POLICY_CATEGORY%</name>
		</category>
	</general>
	<scope>
	  <computer_groups>
	    <computer_group>
	      <id>21</id>
				<name>PT - Faculty and Staff</name>
			</computer_group>
	  </computer_groups>
		<!--Scope added by JSSImporter-->
	</scope>
	<package_configuration>
		<!--Package added by JSSImporter-->
	</package_configuration>
	<scripts>
		<!--Scripts added by JSSImporter-->
	</scripts>
	<self_service>
		<use_for_self_service>true</use_for_self_service>
		<install_button_text>Install %VERSION%</install_button_text>
		<self_service_display_name>%DISPLAY_NAME%</self_service_display_name>
		<reinstall_button_text>Reinstall %DISPLAY_NAME%</reinstall_button_text>
		<self_service_description>%SELF_SERVICE_DESCRIPTION%</self_service_description>
	</self_service>
	<maintenance>
		<recon>true</recon>
	</maintenance>
</policy>
